In [3]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
import numpy as np
import matplotlib.pyplot as plt
import os

In [4]:
engine = create_engine("postgresql://postgres:123@localhost:5432/schools")
connection = engine.connect()

In [5]:
##1 - Average Attendance Rate by city area

In [6]:
stmt = """

SELECT cast(avg(institution_annualrates.attendance_rate)as INT) as average_city_rate, institution.school_city 
FROM institution_annualrates,institution
where institution_annualrates.institution_id = institution.institution_id
group by institution.school_city
order by average_city_rate asc

    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

    average_city_rate          school_city
0                  84  SOUTH RICHMOND HILL
1                  84            RIDGEWOOD
2                  84         FAR ROCKAWAY
3                  85             BROOKLYN
4                  85             FLUSHING
5                  86             ELMHURST
6                  86     SOUTH OZONE PARK
7                  86                BRONX
8                  87             NEW YORK
9                  87               HOLLIS
10                 87        ROCKAWAY PARK
11                 88  SPRINGFIELD GARDENS
12                 88        RICHMOND HILL
13                 88        STATEN ISLAND
14                 88              JAMAICA
15                 88      CAMBRIA HEIGHTS
16                 91       QUEENS VILLAGE
17                 92            BELLEROSE
18                 92           OZONE PARK
19                 93              BAYSIDE
20                 93         SAINT ALBANS
21                 93     LONG ISLAND CITY
22                 93               CORONA
23                 93         FOREST HILLS
24                 94        FRESH MEADOWS
25                 95      JACKSON HEIGHTS
26                 95            REGO PARK

In [7]:
#2 - 10 Schools with the Lowest Attendance Rates

In [8]:
stmt = """

    SELECT institution_annualrates.attendance_rate, institution.entity_name, institution_annualrates.attendance_classification
FROM institution_annualrates,institution
where institution_annualrates.institution_id = institution.institution_id
group by entity_name, institution_annualrates.attendance_rate, institution_annualrates.attendance_classification
order by attendance_rate asc
limit 10

    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

,attendance_rate,entity_name,attendance_classification
0,45,HS 560 CITY-AS-SCHOOL,Low
1,48,BROOKLYN HIGH SCHOOL FOR LEADERSHIP AND COMMUNITY,Low
2,50,QUEENS ACADEMY HIGH SCHOOL,Low
3,51,EDWARD A REYNOLDS WEST SIDE HIGH SCHOOL,Low
4,51,URBAN DOVE TEAM CHARTER SCHOOL II,Low
5,53,ROADS CHARTER SCHOOL II,Low
6,54,VOYAGES PREPARATORY,Low
7,54,BRONX ARENA HIGH SCHOOL,Low
8,54,URBAN DOVE TEAM CHARTER SCHOOL,Low
9,54,RESEARCH AND SERVICE HIGH SCHOOL,Low

In [ ]:
#3 - total funding by school

In [9]:
stmt = """
select institution.entity_name, cast(avg(institution_annualrates.fed_state_local_exp) as INT) AS total_spend
from institution, institution_annualrates
where institution_annualrates.institution_id = institution.institution_id
group by institution.entity_name
order by total_spend asc;

    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

                                           entity_name  total_spend
0                              HARVEY MILK HIGH SCHOOL    2366839.0
1    URBAN ASSEMBLY SCHOOL OF BUSINESS FOR YOUNG WOMEN    2746034.0
2                              BRONX HAVEN HIGH SCHOOL    2837210.0
3             BROOKLYN ACADEMY OF GLOBAL FINANCE (THE)    2839291.0
4                          NEW VENTURES CHARTER SCHOOL    2888892.0
..                                                 ...          ...
547                            TOTTENVILLE HIGH SCHOOL   47938382.0
548                          FRANCIS LEWIS HIGH SCHOOL   51664820.0
549                          FORT HAMILTON HIGH SCHOOL   51787256.0
550                     BROOKLYN TECHNICAL HIGH SCHOOL   57167587.0
551                                 UFT CHARTER SCHOOL          NaN

[552 rows x 2 columns]

In [ ]:
#4- schools by overall status by school district

In [25]:
stmt = """
select institution.school_district_id, institution_annualrates.overall_status, count(*) AS total_schools
from institution_annualrates, institution
where institution.institution_id=institution_annualrates.institution_id
group by institution_annualrates.overall_status,institution.school_district_id
order by institution.school_district_id, institution_annualrates.overall_status     
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   school_district_id                         overall_status  total_schools
0          31010001.0                          Good Standing              7
1          31010001.0       Targeted Support and Improvement              1
2          31020001.0                          Good Standing             71
3          31020001.0       Targeted Support and Improvement              3
4          31030001.0  Comprehensive Support and Improvement              1
..                ...                                    ...            ...
67         34300001.0       Targeted Support and Improvement              1
68         35310001.0                          Good Standing             11
69               None  Comprehensive Support and Improvement              4
70               None                          Good Standing             59
71               None       Targeted Support and Improvement              1

[72 rows x 3 columns]

In [ ]:
#5-School districts with the most schools that require 'Targeted Support and Improvement

In [34]:
stmt = """
select institution.school_district_id, institution_annualrates.overall_status, count(*) AS total_schools
from institution_annualrates, institution
where institution.institution_id=institution_annualrates.institution_id and institution_annualrates.overall_status='Targeted Support and Improvement'
group by institution_annualrates.overall_status,institution.school_district_id
order by total_schools desc
limit 5
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

  school_district_id                    overall_status  total_schools
0         34250001.0  Targeted Support and Improvement              3
1         31050001.0  Targeted Support and Improvement              3
2         33190001.0  Targeted Support and Improvement              3
3         32090001.0  Targeted Support and Improvement              3
4         32100001.0  Targeted Support and Improvement              3

In [ ]:
#6-number of homeless students by school

In [19]:
stmt = """
select institution_annualrates.num_homeless, entity_name, school_city
from institution_annualrates, institution
where institution_annualrates.institution_id=institution.institution_id
order by num_homeless desc

    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

    num_homeless                                entity_name    school_city
0            304                EDWARD R MURROW HIGH SCHOOL       BROOKLYN
1            274                       PS 95 SHEILA MENCHER          BRONX
2            270      FRANKLIN DELANO ROOSEVELT HIGH SCHOOL       BROOKLYN
3            257                 HARRY S TRUMAN HIGH SCHOOL          BRONX
4            250                    NEW UTRECHT HIGH SCHOOL       BROOKLYN
..           ...                                        ...            ...
547            1  NEW YORK CENTER FOR AUTISM CHARTER SCHOOL       NEW YORK
548            1              ELEANOR ROOSEVELT HIGH SCHOOL       NEW YORK
549            1                   EMMA LAZARUS HIGH SCHOOL       NEW YORK
550            0  CSI HIGH SCHOOL FOR INTERNATIONAL STUDIES  STATEN ISLAND
551            0        STATEN ISLAND TECHNICAL HIGH SCHOOL  STATEN ISLAND

[552 rows x 3 columns]

In [ ]:
#7-highest percentage of homeless by school

In [20]:
stmt = """
select institution_annualrates.per_homeless, entity_name, school_city
from institution_annualrates, institution
where institution_annualrates.institution_id=institution.institution_id
order by per_homeless desc
    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

,per_homeless,entity_name,school_city
0,51,ACADEMY FOR LANGUAGE AND TECHNOLOGY,BRONX
1,41,CLAREMONT INTERNATIONAL HIGH SCHOOL,BRONX
2,37,MANHATTAN ACADEMY FOR ARTS AND LANGUAGES,NEW YORK
3,37,BRONX INTERNATIONAL HIGH SCHOOL,BRONX
4,35,ENGLISH LANGUAGE LEARNERS AND INTERNATIONAL SU...,BRONX
...,...,...,...
547,0,ELEANOR ROOSEVELT HIGH SCHOOL,NEW YORK
548,0,SCHOLARS' ACADEMY,ROCKAWAY PARK
549,0,STATEN ISLAND TECHNICAL HIGH SCHOOL,STATEN ISLAND
550,0,EMMA LAZARUS HIGH SCHOOL,NEW YORK
551,0,CSI HIGH SCHOOL FOR INTERNATIONAL STUDIES,STATEN ISLAND

In [ ]:
#8-number of students that require subsidized lunch by school

In [21]:
stmt = """
select sum(institution_annualrates.per_free_lunch+institution_annualrates.per_reduced_lunch) as total_students_subed_lunch, entity_name
from institution_annualrates, institution
where institution_annualrates.institution_id=institution.institution_id
group by entity_name
order by total_students_subed_lunch desc
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

,total_students_subed_lunch,entity_name
0,100,CLAREMONT INTERNATIONAL HIGH SCHOOL
1,99,NEW DAWN CHARTER HIGH SCHOOL
2,99,INTERNATIONAL COMMUNITY HIGH SCHOOL
3,99,ACADEMY FOR LANGUAGE AND TECHNOLOGY
4,98,PS 284 LEW WALLACE
...,...,...
547,18,ELEANOR ROOSEVELT HIGH SCHOOL
548,17,MS 260 CLINTON SCHOOL WRITERS & ARTISTS
549,13,PS 166 RICHARD ROGERS SCHOOL OF THE ARTS & SCI...
550,10,PS 158 BAYLARD TAYLOR
551,8,PS 87 WILLIAM SHERMAN

In [ ]:
#9-Number of schools in district by teacher experience

In [35]:
stmt = """
select institution.school_district_id, institution_annualrates.inexperienced_teach_classification,count(*) As number_of_School
from institution_annualrates, institution
where institution.institution_id=institution_annualrates.institution_id
group by institution_annualrates.inexperienced_teach_classification,institution.school_district_id
order by institution.school_district_id,  institution_annualrates.inexperienced_teach_classification

    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   school_district_id inexperienced_teach_classification  number_of_school
0          31010001.0                        Experienced                 4
1          31010001.0                      Inexperienced                 4
2          31020001.0                        Experienced                27
3          31020001.0                      Inexperienced                37
4          31020001.0             Moderately Experienced                10
..                ...                                ...               ...
83         35310001.0                        Experienced                11
84               None                        Experienced                29
85               None                      Inexperienced                19
86               None             Moderately Experienced                 2
87               None                               None                14

[88 rows x 3 columns]

In [ ]:
#10-overview of schools by teacher experience catagory

In [36]:
stmt = """
select distinct inexperienced_teach_classification, count(*)as Number_of_Schools
from institution_annualrates
group by inexperienced_teach_classification    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

  inexperienced_teach_classification  number_of_schools
0                        Experienced                249
1                      Inexperienced                226
2             Moderately Experienced                 63
3                               None                 14

In [ ]:
#11-school counsler and social worker support compared to the population of students

In [37]:
stmt = """
select pupil_count_tot, sum(institution_annualrates.school_num_counselors+institution_annualrates.school_num_social) as total_support, entity_name
from institution_annualrates, institution
where institution_annualrates.institution_id=institution.institution_id
group by entity_name, pupil_count_tot
order by total_support asc
    
    ;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

    pupil_count_tot total_support                       entity_name
0             647.0             0   BRONX LIGHTHOUSE CHARTER SCHOOL
1             263.0             0   SECONDARY SCHOOL FOR JOURNALISM
2             424.0             0        OPPORTUNITY CHARTER SCHOOL
3             150.0             0  GOTHAM PROFESSIONAL ARTS ACADEMY
4             172.0             0      NEW VISIONS AIM CHARTER HS I
..              ...           ...                               ...
547          3903.0            18         JAMES MADISON HIGH SCHOOL
548          3100.0            19              NEW DORP HIGH SCHOOL
549          1089.0            19       KIPP ACADEMY CHARTER SCHOOL
550          6043.0            19    BROOKLYN TECHNICAL HIGH SCHOOL
551          1866.0            21      KIPP INFINITY CHARTER SCHOOL

[552 rows x 3 columns]